function schul() {
    let route =
        [
            "Холодна Гора",
            "Вокзальна",
            "Центральний ринок",
            "Майдан Конституції",
            "Левада",
            "Спортивна",
            "Заводська",
            "Турбоатом",
            "Палац спорту",
            "Армійська",
            "Ім. О.С. Масельського",
            "Тракторний завод",
            "Індустріальна",
        ];

    while (route.length > 0) {
        alert(route.shift());
    }
    alert('Ви доїхали до школи!');
}
schul();


function home() {
    let route =
        [
            "Індустріальна",
            "Тракторний завод",
            "Ім. О.С. Масельського",
            "Армійська",
            "Палац спорту",
            "Турбоатом",
            "Заводська",
            "Спортивна",
            "Левада",
            "Майдан Конституції",
            "Центральний ринок",
            "Вокзальна",
            "Холодна Гора",
        ];

    while (route.length > 0) {
        alert(route.shift());
    }
    alert('Ура! Вітаю вдома.');
}